doc/resources/benchmark_sysbench/threads24_sysbench-tpcc-haproxy.txt
$ date +%FT%TZ; \
> ./tpcc.lua --mysql-host=* --mysql-port=* --mysql-user=* --mysql-password=* \
> --mysql-db=sbt --report-interval=10 --tables=8 --scale=400 --db-driver=mysql --time=900 --threads=24 run; \
> date +%FT%TZ;
2020-04-28T05:25:34Z
sysbench 1.0.19 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 24
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 24 tps: 369.44 qps: 10401.82 (r/w/o: 4746.53/4906.81/748.48) lat (ms,95%): 130.13 err/s 1.40 reconn/s: 0.00
[ 20s ] thds: 24 tps: 365.40 qps: 10495.05 (r/w/o: 4792.32/4971.93/730.80) lat (ms,95%): 132.49 err/s 1.40 reconn/s: 0.00
[ 30s ] thds: 24 tps: 346.70 qps: 10048.10 (r/w/o: 4575.35/4779.35/693.41) lat (ms,95%): 134.90 err/s 1.40 reconn/s: 0.00
[ 40s ] thds: 24 tps: 374.80 qps: 10512.85 (r/w/o: 4793.68/4969.58/749.60) lat (ms,95%): 132.49 err/s 2.40 reconn/s: 0.00
[ 50s ] thds: 24 tps: 354.30 qps: 10194.78 (r/w/o: 4651.19/4834.99/708.60) lat (ms,95%): 139.85 err/s 0.90 reconn/s: 0.00
[ 60s ] thds: 24 tps: 373.80 qps: 10536.92 (r/w/o: 4808.35/4980.96/747.61) lat (ms,95%): 130.13 err/s 1.80 reconn/s: 0.00
[ 70s ] thds: 24 tps: 363.50 qps: 10172.93 (r/w/o: 4634.57/4811.37/727.00) lat (ms,95%): 137.35 err/s 2.10 reconn/s: 0.00
[ 80s ] thds: 24 tps: 362.20 qps: 10265.45 (r/w/o: 4677.62/4863.42/724.40) lat (ms,95%): 137.35 err/s 1.20 reconn/s: 0.00
[ 90s ] thds: 24 tps: 352.60 qps: 9992.79 (r/w/o: 4565.40/4722.20/705.20) lat (ms,95%): 144.97 err/s 1.60 reconn/s: 0.00
[ 100s ] thds: 24 tps: 349.20 qps: 9931.07 (r/w/o: 4528.78/4703.88/698.40) lat (ms,95%): 200.47 err/s 1.70 reconn/s: 0.00
[ 110s ] thds: 24 tps: 356.10 qps: 10244.32 (r/w/o: 4681.11/4851.01/712.20) lat (ms,95%): 139.85 err/s 1.90 reconn/s: 0.00
[ 120s ] thds: 24 tps: 356.50 qps: 10262.59 (r/w/o: 4687.30/4862.29/713.00) lat (ms,95%): 139.85 err/s 1.30 reconn/s: 0.00
[ 130s ] thds: 24 tps: 347.70 qps: 9891.00 (r/w/o: 4513.80/4681.80/695.40) lat (ms,95%): 223.34 err/s 1.90 reconn/s: 0.00
[ 140s ] thds: 24 tps: 355.60 qps: 10327.04 (r/w/o: 4716.37/4899.57/711.10) lat (ms,95%): 139.85 err/s 1.00 reconn/s: 0.00
[ 150s ] thds: 24 tps: 362.00 qps: 10205.32 (r/w/o: 4659.81/4821.41/724.10) lat (ms,95%): 132.49 err/s 2.10 reconn/s: 0.00
[ 160s ] thds: 24 tps: 349.10 qps: 10015.56 (r/w/o: 4566.93/4750.43/698.20) lat (ms,95%): 204.11 err/s 2.10 reconn/s: 0.00
[ 170s ] thds: 24 tps: 363.70 qps: 10457.54 (r/w/o: 4772.27/4957.87/727.40) lat (ms,95%): 134.90 err/s 1.10 reconn/s: 0.00
[ 180s ] thds: 24 tps: 368.00 qps: 10282.58 (r/w/o: 4684.04/4862.54/736.01) lat (ms,95%): 142.39 err/s 1.10 reconn/s: 0.00
[ 190s ] thds: 24 tps: 366.20 qps: 10084.73 (r/w/o: 4604.07/4748.27/732.39) lat (ms,95%): 134.90 err/s 1.40 reconn/s: 0.00
[ 200s ] thds: 24 tps: 349.80 qps: 9958.97 (r/w/o: 4540.58/4718.78/699.60) lat (ms,95%): 200.47 err/s 1.60 reconn/s: 0.00
[ 210s ] thds: 24 tps: 354.60 qps: 10329.78 (r/w/o: 4716.44/4904.14/709.21) lat (ms,95%): 134.90 err/s 1.80 reconn/s: 0.00
[ 220s ] thds: 24 tps: 357.60 qps: 10169.86 (r/w/o: 4635.58/4819.18/715.10) lat (ms,95%): 139.85 err/s 1.20 reconn/s: 0.00
[ 230s ] thds: 24 tps: 349.50 qps: 10084.83 (r/w/o: 4603.41/4782.32/699.10) lat (ms,95%): 147.61 err/s 2.60 reconn/s: 0.00
[ 240s ] thds: 24 tps: 368.40 qps: 10370.88 (r/w/o: 4724.15/4909.94/736.79) lat (ms,95%): 134.90 err/s 1.20 reconn/s: 0.00
[ 250s ] thds: 24 tps: 356.81 qps: 10299.11 (r/w/o: 4695.99/4889.50/713.61) lat (ms,95%): 134.90 err/s 1.30 reconn/s: 0.00
[ 260s ] thds: 24 tps: 352.00 qps: 10015.40 (r/w/o: 4566.15/4745.25/703.99) lat (ms,95%): 176.73 err/s 1.30 reconn/s: 0.00
[ 270s ] thds: 24 tps: 364.60 qps: 10235.30 (r/w/o: 4671.65/4834.75/728.89) lat (ms,95%): 137.35 err/s 1.30 reconn/s: 0.00
[ 280s ] thds: 24 tps: 367.50 qps: 10410.05 (r/w/o: 4752.12/4922.63/735.30) lat (ms,95%): 139.85 err/s 2.00 reconn/s: 0.00
[ 290s ] thds: 24 tps: 364.10 qps: 10370.10 (r/w/o: 4726.80/4915.10/728.20) lat (ms,95%): 134.90 err/s 1.00 reconn/s: 0.00
[ 300s ] thds: 24 tps: 370.80 qps: 10496.11 (r/w/o: 4790.21/4964.31/741.60) lat (ms,95%): 130.13 err/s 1.70 reconn/s: 0.00
[ 310s ] thds: 24 tps: 349.80 qps: 10129.08 (r/w/o: 4620.89/4808.59/699.60) lat (ms,95%): 158.63 err/s 1.70 reconn/s: 0.00
[ 320s ] thds: 24 tps: 360.20 qps: 10277.30 (r/w/o: 4684.65/4872.25/720.41) lat (ms,95%): 142.39 err/s 1.30 reconn/s: 0.00
[ 330s ] thds: 24 tps: 354.30 qps: 10017.55 (r/w/o: 4573.18/4735.88/708.50) lat (ms,95%): 144.97 err/s 1.10 reconn/s: 0.00
[ 340s ] thds: 24 tps: 361.40 qps: 10426.71 (r/w/o: 4757.16/4946.65/722.89) lat (ms,95%): 132.49 err/s 1.80 reconn/s: 0.00
[ 350s ] thds: 24 tps: 356.40 qps: 10074.68 (r/w/o: 4604.24/4757.64/712.81) lat (ms,95%): 147.61 err/s 1.50 reconn/s: 0.00
[ 360s ] thds: 24 tps: 342.20 qps: 9847.45 (r/w/o: 4494.13/4668.93/684.40) lat (ms,95%): 207.82 err/s 1.90 reconn/s: 0.00
[ 370s ] thds: 24 tps: 377.30 qps: 10582.30 (r/w/o: 4826.55/5001.15/754.59) lat (ms,95%): 134.90 err/s 2.50 reconn/s: 0.00
[ 380s ] thds: 24 tps: 367.00 qps: 10428.69 (r/w/o: 4750.44/4944.24/734.01) lat (ms,95%): 139.85 err/s 1.40 reconn/s: 0.00
[ 390s ] thds: 24 tps: 359.50 qps: 10164.53 (r/w/o: 4628.01/4817.51/719.00) lat (ms,95%): 142.39 err/s 1.90 reconn/s: 0.00
[ 400s ] thds: 24 tps: 357.10 qps: 10263.76 (r/w/o: 4681.58/4867.98/714.20) lat (ms,95%): 170.48 err/s 0.90 reconn/s: 0.00
[ 410s ] thds: 24 tps: 365.90 qps: 10162.72 (r/w/o: 4637.11/4793.81/731.80) lat (ms,95%): 142.39 err/s 1.90 reconn/s: 0.00
[ 420s ] thds: 24 tps: 359.10 qps: 10029.79 (r/w/o: 4567.44/4744.14/718.21) lat (ms,95%): 161.51 err/s 1.60 reconn/s: 0.00
[ 430s ] thds: 24 tps: 357.80 qps: 10510.23 (r/w/o: 4791.37/5003.27/715.60) lat (ms,95%): 132.49 err/s 1.90 reconn/s: 0.00
[ 440s ] thds: 24 tps: 348.50 qps: 9848.17 (r/w/o: 4479.48/4671.68/697.00) lat (ms,95%): 227.40 err/s 1.30 reconn/s: 0.00
[ 450s ] thds: 24 tps: 360.40 qps: 10389.70 (r/w/o: 4738.55/4930.35/720.81) lat (ms,95%): 132.49 err/s 1.10 reconn/s: 0.00
[ 460s ] thds: 24 tps: 362.20 qps: 10453.72 (r/w/o: 4771.46/4957.86/724.39) lat (ms,95%): 153.02 err/s 1.10 reconn/s: 0.00
[ 470s ] thds: 24 tps: 360.30 qps: 10231.90 (r/w/o: 4675.25/4836.05/720.59) lat (ms,95%): 144.97 err/s 2.10 reconn/s: 0.00
[ 480s ] thds: 24 tps: 348.90 qps: 9914.39 (r/w/o: 4526.84/4689.74/697.81) lat (ms,95%): 147.61 err/s 1.90 reconn/s: 0.00
[ 490s ] thds: 24 tps: 352.80 qps: 10106.88 (r/w/o: 4619.25/4782.04/705.59) lat (ms,95%): 150.29 err/s 2.40 reconn/s: 0.00
[ 500s ] thds: 24 tps: 361.10 qps: 10211.81 (r/w/o: 4654.55/4835.05/722.21) lat (ms,95%): 150.29 err/s 2.30 reconn/s: 0.00
[ 510s ] thds: 24 tps: 354.10 qps: 10172.04 (r/w/o: 4648.62/4815.22/708.20) lat (ms,95%): 173.58 err/s 1.90 reconn/s: 0.00
[ 520s ] thds: 24 tps: 359.20 qps: 10310.60 (r/w/o: 4693.16/4899.55/717.89) lat (ms,95%): 142.39 err/s 1.80 reconn/s: 0.00
[ 530s ] thds: 24 tps: 349.60 qps: 9975.21 (r/w/o: 4550.35/4725.15/699.71) lat (ms,95%): 150.29 err/s 1.70 reconn/s: 0.00
[ 540s ] thds: 24 tps: 351.90 qps: 10026.75 (r/w/o: 4570.68/4752.28/703.80) lat (ms,95%): 186.54 err/s 1.60 reconn/s: 0.00
[ 550s ] thds: 24 tps: 341.00 qps: 9980.43 (r/w/o: 4553.01/4745.41/682.00) lat (ms,95%): 150.29 err/s 2.10 reconn/s: 0.00
[ 560s ] thds: 24 tps: 355.80 qps: 10042.34 (r/w/o: 4586.87/4743.87/711.60) lat (ms,95%): 200.47 err/s 1.60 reconn/s: 0.00
[ 570s ] thds: 24 tps: 358.80 qps: 10122.29 (r/w/o: 4627.54/4777.14/717.61) lat (ms,95%): 142.39 err/s 1.80 reconn/s: 0.00
[ 580s ] thds: 24 tps: 358.70 qps: 9901.09 (r/w/o: 4515.80/4667.90/717.40) lat (ms,95%): 164.45 err/s 2.20 reconn/s: 0.00
[ 590s ] thds: 24 tps: 359.70 qps: 10162.73 (r/w/o: 4635.47/4807.87/719.40) lat (ms,95%): 147.61 err/s 1.60 reconn/s: 0.00
[ 600s ] thds: 24 tps: 356.00 qps: 10038.94 (r/w/o: 4581.42/4745.52/712.00) lat (ms,95%): 147.61 err/s 1.50 reconn/s: 0.00
[ 610s ] thds: 24 tps: 348.90 qps: 9711.61 (r/w/o: 4422.01/4591.81/697.80) lat (ms,95%): 142.39 err/s 1.70 reconn/s: 0.00
[ 620s ] thds: 24 tps: 340.10 qps: 9797.32 (r/w/o: 4477.46/4639.66/680.19) lat (ms,95%): 158.63 err/s 1.40 reconn/s: 0.00
[ 630s ] thds: 24 tps: 345.60 qps: 9953.70 (r/w/o: 4539.40/4723.70/690.60) lat (ms,95%): 139.85 err/s 1.60 reconn/s: 0.00
[ 640s ] thds: 24 tps: 343.90 qps: 9860.86 (r/w/o: 4502.08/4670.38/688.40) lat (ms,95%): 170.48 err/s 1.60 reconn/s: 0.00
[ 650s ] thds: 24 tps: 361.20 qps: 10222.69 (r/w/o: 4665.34/4834.94/722.41) lat (ms,95%): 142.39 err/s 1.50 reconn/s: 0.00
[ 660s ] thds: 24 tps: 350.30 qps: 10110.25 (r/w/o: 4613.48/4796.18/700.60) lat (ms,95%): 150.29 err/s 1.20 reconn/s: 0.00
[ 670s ] thds: 24 tps: 367.70 qps: 10342.21 (r/w/o: 4717.45/4889.35/735.41) lat (ms,95%): 137.35 err/s 1.40 reconn/s: 0.00
[ 680s ] thds: 24 tps: 364.20 qps: 10441.81 (r/w/o: 4761.40/4952.00/728.40) lat (ms,95%): 142.39 err/s 1.90 reconn/s: 0.00
[ 690s ] thds: 24 tps: 345.80 qps: 9968.60 (r/w/o: 4554.50/4722.50/691.60) lat (ms,95%): 186.54 err/s 0.80 reconn/s: 0.00
[ 700s ] thds: 24 tps: 354.50 qps: 10087.13 (r/w/o: 4595.11/4783.01/709.00) lat (ms,95%): 142.39 err/s 1.50 reconn/s: 0.00
[ 710s ] thds: 24 tps: 355.00 qps: 10125.16 (r/w/o: 4624.48/4790.68/710.00) lat (ms,95%): 155.80 err/s 1.90 reconn/s: 0.00
[ 720s ] thds: 24 tps: 352.80 qps: 10147.15 (r/w/o: 4628.38/4813.17/705.60) lat (ms,95%): 161.51 err/s 1.40 reconn/s: 0.00
[ 730s ] thds: 24 tps: 356.10 qps: 10178.74 (r/w/o: 4641.72/4824.82/712.20) lat (ms,95%): 150.29 err/s 1.20 reconn/s: 0.00
[ 740s ] thds: 24 tps: 365.80 qps: 10429.17 (r/w/o: 4758.29/4939.29/731.60) lat (ms,95%): 137.35 err/s 1.50 reconn/s: 0.00
[ 750s ] thds: 24 tps: 357.30 qps: 10316.41 (r/w/o: 4713.70/4888.10/714.60) lat (ms,95%): 132.49 err/s 2.60 reconn/s: 0.00
[ 760s ] thds: 24 tps: 347.40 qps: 10002.46 (r/w/o: 4558.08/4749.58/694.80) lat (ms,95%): 170.48 err/s 0.90 reconn/s: 0.00
[ 770s ] thds: 24 tps: 363.80 qps: 10221.17 (r/w/o: 4659.93/4833.73/727.50) lat (ms,95%): 142.39 err/s 1.70 reconn/s: 0.00
[ 780s ] thds: 24 tps: 362.70 qps: 10370.52 (r/w/o: 4729.01/4916.01/725.50) lat (ms,95%): 144.97 err/s 2.20 reconn/s: 0.00
[ 790s ] thds: 24 tps: 366.30 qps: 10409.16 (r/w/o: 4745.18/4931.38/732.60) lat (ms,95%): 132.49 err/s 1.70 reconn/s: 0.00
[ 800s ] thds: 24 tps: 367.20 qps: 10251.34 (r/w/o: 4670.17/4846.77/734.40) lat (ms,95%): 137.35 err/s 1.10 reconn/s: 0.00
[ 810s ] thds: 24 tps: 371.30 qps: 10587.91 (r/w/o: 4838.05/5007.25/742.61) lat (ms,95%): 130.13 err/s 2.00 reconn/s: 0.00
[ 820s ] thds: 24 tps: 363.20 qps: 10380.01 (r/w/o: 4745.10/4908.50/726.40) lat (ms,95%): 155.80 err/s 1.50 reconn/s: 0.00
[ 830s ] thds: 24 tps: 369.00 qps: 10359.02 (r/w/o: 4724.46/4896.56/737.99) lat (ms,95%): 144.97 err/s 1.80 reconn/s: 0.00
[ 840s ] thds: 24 tps: 356.29 qps: 10095.92 (r/w/o: 4605.42/4777.91/712.59) lat (ms,95%): 153.02 err/s 1.30 reconn/s: 0.00
[ 850s ] thds: 24 tps: 354.51 qps: 10124.42 (r/w/o: 4611.10/4804.30/709.02) lat (ms,95%): 147.61 err/s 2.00 reconn/s: 0.00
[ 860s ] thds: 24 tps: 363.70 qps: 10283.79 (r/w/o: 4695.90/4860.50/727.40) lat (ms,95%): 134.90 err/s 2.50 reconn/s: 0.00
[ 870s ] thds: 24 tps: 359.70 qps: 10172.88 (r/w/o: 4632.29/4821.19/719.40) lat (ms,95%): 150.29 err/s 1.20 reconn/s: 0.00
[ 880s ] thds: 24 tps: 357.90 qps: 10204.98 (r/w/o: 4662.99/4826.19/715.80) lat (ms,95%): 137.35 err/s 1.60 reconn/s: 0.00
[ 890s ] thds: 24 tps: 357.90 qps: 10102.74 (r/w/o: 4605.62/4781.32/715.80) lat (ms,95%): 155.80 err/s 1.40 reconn/s: 0.00
[ 900s ] thds: 24 tps: 359.40 qps: 10104.26 (r/w/o: 4604.68/4780.78/718.80) lat (ms,95%): 155.80 err/s 1.60 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            4184551
        write:                           4343599
        other:                           644702
        total:                           9172852
    transactions:                        322315 (358.02 per sec.)
    queries:                             9172852 (10189.10 per sec.)
    ignored errors:                      1459   (1.62 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          900.2601s
    total number of events:              322315

Latency (ms):
         min:                                    2.32
         avg:                                   67.02
         max:                                  587.92
         95th percentile:                      144.97
         sum:                             21601131.05

Threads fairness:
    events (avg/stddev):           13429.7917/137.52
    execution time (avg/stddev):   900.0471/0.06

2020-04-28T05:40:34Z